{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(1, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 1], [19, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "1024", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution4_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "1024", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "1024", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attrs": {
        "kernel": "(1, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attrs": {
        "kernel": "(2, 2)", 
        "num_filter": "1024", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution5_bias", 
      "attrs": {
        "kernel": "(2, 2)", 
        "num_filter": "1024", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "kernel": "(2, 2)", 
        "num_filter": "1024", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attrs": {"axes": "(0, 3, 1, 2)"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel0", 
      "attrs": {
        "num_outputs": "22", 
        "squeeze_axis": "0"
      }, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[38, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[44, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[44, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_c", 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[44, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[48, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[45, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[57, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[63, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[63, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_c", 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[63, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul4", 
      "inputs": [[68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[67, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul5", 
      "inputs": [[64, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 1, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[54, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[77, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[77, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul6", 
      "inputs": [[79, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[77, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul7", 
      "inputs": [[81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[80, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation14", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul8", 
      "inputs": [[78, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[86, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[73, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[90, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation17", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[90, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul9", 
      "inputs": [[92, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation15", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation16", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[90, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul10", 
      "inputs": [[94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[93, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation19", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul11", 
      "inputs": [[91, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 2, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[86, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation23", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[103, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation22", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[103, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul12", 
      "inputs": [[105, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation20", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation21", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[103, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul13", 
      "inputs": [[107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[106, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation24", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul14", 
      "inputs": [[104, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[112, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[99, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation28", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[116, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation27", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[116, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul15", 
      "inputs": [[118, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation25", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation26", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[116, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul16", 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[119, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation29", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul17", 
      "inputs": [[117, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 3, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[112, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation33", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[129, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation32", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[129, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul18", 
      "inputs": [[131, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation30", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation31", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[129, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul19", 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[132, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation34", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul20", 
      "inputs": [[130, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[138, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[125, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[139, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation38", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[142, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation37", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[142, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul21", 
      "inputs": [[144, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation35", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation36", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[142, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul22", 
      "inputs": [[146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[145, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation39", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul23", 
      "inputs": [[143, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 4, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[138, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[152, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation43", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[155, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation42", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[155, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul24", 
      "inputs": [[157, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation40", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation41", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[155, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul25", 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[158, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation44", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul26", 
      "inputs": [[156, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[164, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[151, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus18", 
      "inputs": [[165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation48", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[168, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation47", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[168, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul27", 
      "inputs": [[170, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation45", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation46", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[168, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul28", 
      "inputs": [[172, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
      "inputs": [[171, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation49", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul29", 
      "inputs": [[169, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 5, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[164, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus20", 
      "inputs": [[178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation53", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[181, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation52", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[181, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul30", 
      "inputs": [[183, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation50", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation51", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[181, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul31", 
      "inputs": [[185, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus21", 
      "inputs": [[184, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation54", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul32", 
      "inputs": [[182, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[190, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[177, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus22", 
      "inputs": [[191, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation58", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[194, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation57", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[194, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul33", 
      "inputs": [[196, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation55", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation56", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[194, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul34", 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus23", 
      "inputs": [[197, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation59", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul35", 
      "inputs": [[195, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 6, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[190, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus24", 
      "inputs": [[204, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation63", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[207, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation62", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[207, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul36", 
      "inputs": [[209, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation60", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[207, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation61", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[207, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul37", 
      "inputs": [[211, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus25", 
      "inputs": [[210, 0, 0], [213, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation64", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul38", 
      "inputs": [[208, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[216, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[203, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus26", 
      "inputs": [[217, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation68", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[220, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation67", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[220, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul39", 
      "inputs": [[222, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation65", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation66", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[220, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul40", 
      "inputs": [[224, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus27", 
      "inputs": [[223, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation69", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul41", 
      "inputs": [[221, 0, 0], [228, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 7, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[216, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus28", 
      "inputs": [[230, 0, 0], [231, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation73", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[233, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation72", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[233, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul42", 
      "inputs": [[235, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation70", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[233, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation71", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[233, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul43", 
      "inputs": [[237, 0, 0], [238, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus29", 
      "inputs": [[236, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation74", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul44", 
      "inputs": [[234, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[242, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[229, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus30", 
      "inputs": [[243, 0, 0], [244, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[245, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation78", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[246, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation77", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[246, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul45", 
      "inputs": [[248, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation75", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation76", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[246, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul46", 
      "inputs": [[250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus31", 
      "inputs": [[249, 0, 0], [252, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation79", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[253, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul47", 
      "inputs": [[247, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 8, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[242, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus32", 
      "inputs": [[256, 0, 0], [257, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t8_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation83", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[259, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation82", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[259, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul48", 
      "inputs": [[261, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation80", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[259, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation81", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[259, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul49", 
      "inputs": [[263, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus33", 
      "inputs": [[262, 0, 0], [265, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation84", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul50", 
      "inputs": [[260, 0, 0], [267, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l1_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[268, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l1_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[255, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus34", 
      "inputs": [[269, 0, 0], [270, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t8_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[271, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation88", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[272, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation87", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[272, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul51", 
      "inputs": [[274, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation85", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation86", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[272, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul52", 
      "inputs": [[276, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus35", 
      "inputs": [[275, 0, 0], [278, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation89", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul53", 
      "inputs": [[273, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 9, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[268, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus36", 
      "inputs": [[282, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t9_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation93", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[285, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation92", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[285, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul54", 
      "inputs": [[287, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation90", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[285, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation91", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[285, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul55", 
      "inputs": [[289, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus37", 
      "inputs": [[288, 0, 0], [291, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation94", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul56", 
      "inputs": [[286, 0, 0], [293, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l1_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[294, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l1_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[281, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus38", 
      "inputs": [[295, 0, 0], [296, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t9_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[297, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation98", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[298, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation97", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[298, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul57", 
      "inputs": [[300, 0, 0], [279, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation95", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation96", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[298, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul58", 
      "inputs": [[302, 0, 0], [303, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus39", 
      "inputs": [[301, 0, 0], [304, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation99", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul59", 
      "inputs": [[299, 0, 0], [306, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 10, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[294, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus40", 
      "inputs": [[308, 0, 0], [309, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t10_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation103", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[311, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation102", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[311, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul60", 
      "inputs": [[313, 0, 0], [292, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation100", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation101", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[311, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul61", 
      "inputs": [[315, 0, 0], [316, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus41", 
      "inputs": [[314, 0, 0], [317, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation104", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul62", 
      "inputs": [[312, 0, 0], [319, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l1_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[320, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l1_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[307, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus42", 
      "inputs": [[321, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t10_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[323, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation108", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[324, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation107", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[324, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul63", 
      "inputs": [[326, 0, 0], [305, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation105", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[324, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation106", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[324, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul64", 
      "inputs": [[328, 0, 0], [329, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus43", 
      "inputs": [[327, 0, 0], [330, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation109", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul65", 
      "inputs": [[325, 0, 0], [332, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 11, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[320, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus44", 
      "inputs": [[334, 0, 0], [335, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t11_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation113", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[337, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation112", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[337, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul66", 
      "inputs": [[339, 0, 0], [318, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation110", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[337, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation111", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[337, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul67", 
      "inputs": [[341, 0, 0], [342, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus45", 
      "inputs": [[340, 0, 0], [343, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation114", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[344, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul68", 
      "inputs": [[338, 0, 0], [345, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l1_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[346, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l1_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[333, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus46", 
      "inputs": [[347, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t11_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[349, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation118", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[350, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation117", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[350, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul69", 
      "inputs": [[352, 0, 0], [331, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation115", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[350, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation116", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[350, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul70", 
      "inputs": [[354, 0, 0], [355, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus47", 
      "inputs": [[353, 0, 0], [356, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation119", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[357, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul71", 
      "inputs": [[351, 0, 0], [358, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l0_i2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[35, 12, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l0_h2h", 
      "attrs": {"num_hidden": "2048"}, 
      "inputs": [[346, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus48", 
      "inputs": [[360, 0, 0], [361, 0, 0]]
    }, 
    {
